Revit 2024 API
CurveElement.GetAdjoinedCurveElements Method
 Returns elements that are joining with this curve element at the given end point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ISet<ElementId> GetAdjoinedCurveElements(
	int end
)
Visual Basic
Public Function GetAdjoinedCurveElements ( _
	end As Integer _
) As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetAdjoinedCurveElements(
	int end
)
Parameters
end
Type: System.Int32
 Id of one the curve's end. Value '0' indicates start and '1' indicates the end of the curve, respectively.
Return Value
 Collection of Ids of Curve Elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given Id does not represent any of the two end-points of a curve element. A valid value of either '0' or '1' is expected.
See Also
CurveElement Class
Autodesk.Revit.DB Namespace